Tekla Open API Reference for Tekla Structures 2025
View.ViewShorteningAttributes Class
 The ViewShorteningAttributes class sets the shortening attributes for the view. If CutParts is set to true, the other values are applied. If it is false, none of the other values matter.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.View.ViewShorteningAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ViewShorteningAttributes : GenericAttributesBase
<SerializableAttribute>
Public NotInheritable Class ViewShorteningAttributes
	Inherits GenericAttributesBase
The View.ViewShorteningAttributes type exposes the following members.
Constructors
Name | Description
View.ViewShorteningAttributes()
 Creates a new default view shortening attributes instance.
View.ViewShorteningAttributes(Boolean, Boolean, Double, Double, View.ShorteningCutPartType)
 Creates a new view shortening attributes instance with the given parameters.
Top
Properties
Name | Description
CutParts
 Defines whether cut parts are enabled (true) or disabled (false).
CutPartType
 Defines cut part type. Not used if CutParts is false.
CutSkewParts
 Defines whether cut skewed parts are enabled (true) or disabled (false).
MinimumLength
 The minimum cut part length.
Offset
 The space between the cut parts.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace